/// отсюда мы экспортируем наши переменные или функции(описываем и отдаем)
// const myExportName = 'Vitaliy'
// export default myExportName /// экспорт по умолчанию

///////////////////////

// const sum = (a, b) => a + b // мы не вызываем здесь функцию мы ее вызывает там куда мы будем импортировать ее

// export default sum


//////////////////////////////////
// Несколько экспортов
// const one = 1
// const two = 'two'

// export { /// имена переменных в данном примере должны совпадать
//   one,
//   two
// } /////// Таким образом мы экспортировали несколько переменных



////////////////////////////////
//// Экспортируем несколько функций
// const sum = (a, b) => {
//   return a + b
// }

// const mult = (a, b) => {
//   return a * b
// }

// export {
//   sum,
//   mult
// }
